# EA_DataAccSelUI

## Description
Selects item in popup and update system data.

```pascal
PROCEDURE EA_DataAccSelUI(
				acc      : INTEGER;
				dialogID : INTEGER;
				ctrlID   : INTEGER;
				uiIndex  : INTEGER);
```

```python
def vs.EA_DataAccSelUI(acc, dialogID, ctrlID, uiIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |
|dialogID|INTEGER|   |
|ctrlID|INTEGER|   |
|uiIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library